Revit 2027 API
BuiltInFailures.SteelElementFailures.SteelElementPreviewTaskNotFinished Property
 Cannot create preview while background calculations are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementPreviewTaskNotFinished { get; }
Public Shared ReadOnly Property SteelElementPreviewTaskNotFinished As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementPreviewTaskNotFinished {
	FailureDefinitionId^ get ();
}
static member SteelElementPreviewTaskNotFinished : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace